
<p><img src="img/un/h/faq_vp.jpg" width="116" height="128" border="0" alt="نقطة التجمع" title="نقطة التجمع" align="right"></p>

<p class="question">كيف يمكنني بناء نقطة التجمع؟</p>

<p class="answer">نقطة التجمع يمكن بناؤها في موقع واحد فقط. هذا الموقع يقع على يمين مركز قريتك في المرج.</p>



<p><img src="img/un/h/faq_botschaft.jpg" width="122" height="150" border="0" alt="السفارة" title="السفارة" align="left"></p>

<p class="question">كيف يمكنني تأسيس تحالف؟</p>

<p class="answer">لتأسيس تحالف تحتاج إلى سفارة بمستوى 3. للانضمام إلى تحالف تحتاج فقط إلى سفارة بمستوى 1 ودعوة بالطبع للانضمام إلى التحالف.</p>



<p class="question">كيف يمكنني تغيير اسم قريتي؟</p>

<p class="answer">أولاً اختر القرية التي ترغب في إعادة تسميتها بالنقر عليها تحت <i>القرى</i>. ثم انقر على <i>الملف الشخصي</i> على اليسار ثم <i>تعديل الملف الشخصي</i>. غيّر الاسم في خانة <i>اسم القرية</i> ثم انقر موافق.</p>



<p class="question">كيف أدرّب الجنود؟</p>

<p class="answer">تحتاج إلى نقطة تجمع بمستوى 1 على الأقل ومبنى رئيسي بمستوى 3 على الأقل. عندما يتوفر لديك ذلك يمكنك بناء الثكنة وهناك يمكنك تدريب المشاة.</p>



<p class="question">كيف أدافع عن قريتي؟</p>

<p class="answer">طالما يوجد جنود (جنودك أو جنود مُرسلة لتعزيزك) في قريتك فإنهم يدافعون عن قريتك تلقائياً.</p>

<p class="answer">كل مبنى يزيد عدد سكان قريتك بعدد معين من السكان الجدد. عدد السكان الجدد الناتج عن رفع/تطوير مبنى يظهر بجانب الرمز <img src="img/un/res/5.gif" width="18" height="12" border="0" alt="استهلاك القمح" title="استهلاك القمح">.</p>



<p class="question">النجدة، إنتاج القمح ينخفض أكثر وأكثر!</p>

<p class="answer">في <i>الإنتاج</i> (مثلاً 10) يظهر إنتاج القمح مطروحاً منه استهلاك القمح بسبب <i>عدد السكان</i> (مثلاً 5) و<i>الجنود</i>. إجمالي إنتاج القمح يظهر في الزاوية العلوية اليمنى. مثلاً: <img src="img/un/res/5.gif" width="18" height="12" border="0" alt="استهلاك القمح" title="استهلاك القمح"> 5/15

<br>في المثال 8 سيكون استهلاك القمح، 15 إجمالي إنتاج القمح، <br>15 - 8 = 7 وحدات قمح في الساعة. </p>



<p class="question">لماذا ينهب جنودي موارد قليلة جداً؟</p>

<p class="answer">هناك تفسيران. أولاً، كل نوع من الجنود يمكنه حمل كمية معينة فقط من الموارد. ثانياً، قد يكون لدى ضحيتك <i>مخبأ</i> حيث يخفي القرويون تلقائياً كمية معينة من الموارد التي لا تستطيع جحافلك الغازية العثور عليها.</p>



<p class="question">كيف يمكنني تأسيس أو احتلال قرى جديدة؟</p>

<p class="answer">تحتاج إلى ثلاثة مستوطنين لتأسيس قرية جديدة. لاحتلال قرية تحتاج إلى مسؤول (سيناتور، زعيم أو شيخ قبيلة) والذي يمكن تدريبه في القصر/مقر الإقامة بمستوى 10. بالإضافة إلى ذلك تحتاج إلى عدد معين من <a href="anleitung.php?s=4">نقاط الحضارة</a>.</p>



<p class="question">هل يمكنني خسارة قرية؟</p>

<p class="answer">كل قرية يمكن قصفها بالمنجنيق إلى 0 سكان وطالما أنها ليست آخر قراك ستختفي بعد وقت قصير. القرية الوحيدة التي لا يمكن احتلالها هي العاصمة. لاحظ أن تدمير العاصمة لا يزال ممكناً.</p>

</div>
	<div class="clear"></div> 
</div> 
 
<div id="footer">

	<div class="container">

		<a href="#" class="logo"><img src="img/x.gif" alt="Travian Games" class="logo_traviangames" /></a>

			<li class="copyright">&copy; 2010 - <?php echo date('Y') . ' ' . (defined('SERVER_NAME') ? SERVER_NAME : 'TravianZ');?> جميع الحقوق محفوظة</li>

	</div>

</div> 
</div> 
