<?php

//////////////////////////////////////////////////////////////////////////////////////////////////////
//                                             TRAVIANZ                                             //
//            Only for advanced users, do not edit if you dont know what are you doing!             //
//                                Made by: Dzoki & Dixie (TravianZ)                                 //
//                              - TravianZ = Travian Clone Project -                                //
//                                 DO NOT REMOVE COPYRIGHT NOTICE!                                  //
//                                Adding tasks, constructions and artefact  by: Armando             //
//                                Modified , added , fixed , implementd  by: Shadow and ronix       //
//////////////////////////////////////////////////////////////////////////////////////////////////////
									//                         //
									//         ENGLISH         //
									//      Author: Dzoki      //
									//     Adding: Armando     //
									/////////////////////////////

//MAIN MENU
define('TRIBE1', 'الرومان');
define('TRIBE2', 'الجرمان');
define('TRIBE3', 'الإغريق');
define('TRIBE4', 'طبيعة');
define('TRIBE5', 'التتار');
define('TRIBE6', 'وحوش');

define('HOME', 'الصفحة الرئيسية');
define('INSTRUCT', 'التعليمات');
define('ADMIN_PANEL', 'لوحة الإدارة');
define('MH_PANEL', 'لوحة المراقب');
define('MASS_MESSAGE', 'رسالة جماعية');
define('LOGOUT', 'تسجيل الخروج');
define('PROFILE', 'الملف الشخصي');
define('SUPPORT', 'الدعم الفني');
define('UPDATE_T_10', 'تحديث أفضل 10');
define('SYSTEM_MESSAGE', 'رسالة النظام');
define('TRAVIAN_PLUS', 'ترافيان <b><span class="plus_g">ب</span><span class="plus_o">ل</span><span class="plus_g">س</span></span></span></b>');
define('CONTACT', 'اتصل بنا!');
define('GAME_RULES', 'قوانين اللعبة');
define('BUILD_CROPPER', 'تأسيس قرية قمحية');
define('NONE', 'لا شيء');
define('HERO', 'البطل');

//MENU
define('REG', 'تسجيل');
define('FORUM', 'المنتدى');
define('CHAT', 'الدردشة');
define('IMPRINT', 'بصمة');
define('MORE_LINKS', 'المزيد من الروابط');
define('TOUR', 'جولة في اللعبة');


//ERRORS
define('USRNM_EMPTY', '(اسم المستخدم فارغ)');
define('USRNM_TAKEN', '(الاسم مستخدم مسبقاً)');
define('USRNM_SHORT', '(على الأقل '.USRNM_MIN_LENGTH.' حروف)');
define('USRNM_CHAR', '(أحرف غير صالحة)');
define('PW_EMPTY', '(كلمة المرور فارغة)');
define('PW_SHORT', '(على الأقل '.PW_MIN_LENGTH.' حروف)');
define('PW_INSECURE', '(كلمة المرور غير آمنة. يرجى اختيار واحدة أكثر أماناً.)');
define('EMAIL_EMPTY', '(البريد الإلكتروني فارغ)');
define('EMAIL_INVALID', '(بريد إلكتروني غير صالح)');
define('EMAIL_TAKEN', '(البريد الإلكتروني مستخدم مسبقاً)');
define('TRIBE_EMPTY', '<li>يرجى اختيار القبيلة.</li>');
define('AGREE_ERROR', '<li>يجب عليك الموافقة على قوانين اللعبة والشروط العامة للتسجيل.</li>');
define('LOGIN_USR_EMPTY', 'أدخل الاسم.');
define('LOGIN_PASS_EMPTY', 'أدخل كلمة المرور.');
define('EMAIL_ERROR', 'البريد الإلكتروني لا يتطابق');
define('PASS_MISMATCH', 'كلمات المرور لا تتطابق');
define('ALLI_OWNER', 'يرجى تعيين قائد للتحالف قبل الحذف');
define('SIT_ERROR', 'تم إعداد الوكيل مسبقاً أو لم يتم العثور على اللاعب');
define('USR_NT_FOUND', 'الاسم غير موجود.');
define('LOGIN_PW_ERROR', 'كلمة المرور خاطئة.');
define('WEL_TOPIC', 'معلومات ونصائح مفيدة ');
define('ATAG_EMPTY', 'الاختصار فارغ');
define('ANAME_EMPTY', 'الاسم فارغ');
define('ATAG_EXIST', 'الاختصار مستخدم مسبقاً');
define('ANAME_EXIST', 'الاسم مستخدم مسبقاً');
define('ALREADY_ALLY_MEMBER', 'أنت بالفعل في تحالف');
define('ALLY_TOO_LOW', 'يجب أن يكون مستوى السفارة 3 أو أعلى');
define('USER_NOT_IN_YOUR_ALLY', 'هذا اللاعب ليس في تحالفك!');
define('CANT_EDIT_YOUR_PERMISSIONS', 'لا يمكنك تعديل صلاحياتك!');
define('CANT_EDIT_LEADER_PERMISSIONS', 'لا يمكن تعديل صلاحيات قائد التحالف!');
define('NO_PERMISSION', 'لا تمتلك الصلاحيات الكافية!');
define('NAME_OR_DIPL_EMPTY', 'الاسم أو الدبلوماسية فارغة');
define('ALLY_DOESNT_EXISTS', 'التحالف غير موجود');
define('CANNOT_INVITE_SAME_ALLY', 'لا يمكنك دعوة تحالفك الخاص');
define('WRONG_DIPLOMACY', 'اختيار خاطئ');
define('INVITE_ALREADY_SENT', 'إما أنك أرسلت ميثاقاً مسبقاً، أو هم أرسلوا لك، أو يوجد ميثاق بالفعل');
define('INVITE_SENT', 'تم إرسال الدعوة');
define('DECLARED_WAR_ON', 'أعلن الحرب على');
define('OFFERED_NON_AGGRESION_PACT_TO', 'عرض ميثاق عدم اعتداء لـ');
define('OFFERED_CONFED_TO', 'عرض تحالف لـ');
define('ALLY_TOO_MUCH_PACTS', 'إما أنك لا تستطيع تقديم المزيد من المواثيق أو أن التحالف بلغ الحد الأقصى');
define('ALLY_PERMISSIONS_UPDATED', 'تم تحديث الصلاحيات');
define('ALLY_FORUM_LINK_UPDATED', 'تم تحديث رابط المنتدى');
define('NO_FORUMS_YET', 'لا توجد منتديات بعد.');
define('ALLY_USER_KICKED', ' تم طرده من التحالف');
define('NOT_OPENED_YET', 'السيرفر لم يبدأ بعد.');
define('REGISTER_CLOSED', 'التسجيل مغلق. لا يمكنك التسجيل في هذا السيرفر.');
define('NAME_EMPTY', 'يرجى إدخال الاسم');
define('NAME_NO_EXIST', 'لا يوجد مستخدم بالاسم ');
define('ID_NO_EXIST', 'لا يوجد مستخدم بالرقم التعريفي ');
define('SAME_NAME', 'لا يمكنك دعوة نفسك');
define('ALREADY_INVITED', ' مدعو مسبقاً');
define('ALREADY_IN_ALLY', ' موجود بالفعل في هذا التحالف');
define('ALREADY_IN_AN_ALLY', ' موجود بالفعل في تحالف');
define('NAME_OR_TAG_CHANGED', 'تم تغيير الاسم أو الاختصار');
define('VAC_MODE_WRONG_DAYS', 'لقد أدخلت عدداً خاطئاً من الأيام');

//COPYRIGHT
define('TRAVIAN_COPYRIGHT', 'ترافيان نسخة مفتوحة المصدر 100%.');

//BUILD.TPL
define('CUR_PROD', 'الإنتاج الحالي');
define('NEXT_PROD', 'الإنتاج في المستوى ');
define('CONSTRUCT_BUILD', 'تشييد المبنى');

//DORF1
define('LUMBER', 'خشب');
define('CLAY', 'طين');
define('IRON', 'حديد');
define('CROP', 'قمح');
define('LEVEL', 'مستوى');
define('CROP_COM', 'استهلاك ال'.CROP);
define('PER_HR', 'في الساعة');
define('PRODUCTION', 'الإنتاج');
define('CAPITAL1', 'العاصمة');
define('VILLAGES', 'القرى');
define('ANNOUNCEMENT', 'إعلان');
define('GO2MY_VILLAGE', 'الذهاب لقريتي');
define('VILLAGE_CENTER', 'مركز القرية');
define('FINISH_GOLD', 'إنهاء جميع أوامر البناء والبحث في هذه القرية فوراً مقابل 2 ذهب؟');
define('WAITING_LOOP', '(قائمة الانتظار)');
define('CROP_NEGATIVE', 'إنتاج القمح لديك سالب، لن تصل أبدًا إلى كمية الموارد المطلوبة.');
define('HR', 'ساعة');
define('HRS', '(ساعات)');
define('DONE_AT', 'ينتهي في');
define('CANCEL', 'إلغاء');
define('LOYALTY', 'الولاء');
define('CALCULATED_IN', 'تم الحساب في');
define('HI', 'أهلاً');
define('P_IN', 'في');
define('MS', 'جزء من الثانية');
define('SERVER_TIME', 'وقت الخادم:');
define('REMAINING_GOLD', 'الذهب المتبقي');

// HEADER && MENU && Messages && Reports
define('REPORTS', 'التقارير');
define('MESSAGES', 'الرسائل');
define('PLUS_MENU', 'قائمة بلس');
define('LINKS', 'الروابط');
define('CANCEL_PROCESS', 'إلغاء العملية');
define('ACCOUNT_DELETING', 'سيتم حذف الحساب في');
define('INBOX', 'الوارد');
define('WRITE', 'اكتب');
define('SENT', 'المرسلة');
define('SEND', 'إرسال');
define('ARCHIVE', 'الأرشيف');
define('NOTES', 'الملاحظات');
define('SUBJECT', 'الموضوع');
define('SENDER', 'المرسل');
define('RECIPIENT', 'المستلم');
define('BACK', 'الرجوع');
define('NEW', 'جديد');
define('UNREAD', 'غير مقروء');
define('NO_MESS', 'لا توجد رسائل');
define('NO_MESS_IN_ARCHIVE', 'لا توجد رسائل في الأرشيف');
define('NO_MESS_SENT', 'لا توجد رسائل مرسلة');
define('MESS_FOR_SUP', 'رسالة للدعم الفني');
define('MESS_FOR_MH', 'رسالة للصياد');
define('SEND_AS_SUP', 'إرسال كدعم فني');
define('SEND_AS_MH', 'إرسال كصياد');
define('SAVE', 'حفظ');
define('ANSWER', 'إجابة');
define('REPLY', 'رد');
define('ADDRESSBOOK', 'دفتر العناوين');
define('CLOSE_ADDRESSBOOK', 'إغلاق دفتر العناوين');
define('ONLINE_S1', 'متصل الآن');
define('ONLINE_S2', 'غير متصل');
define('ONLINE_S3', 'آخر 3 أيام');
define('ONLINE_S4', 'آخر 7 أيام');
define('ONLINE_S5', 'غير نشط');
define('WAIT_FOR_CONFIRM', 'في انتظار التأكيد');
define('CONFIRM', 'تأكيد');
define('WRITE_MESS_WARN', '<b>تحذير:</b> لا يمكنك استخدام القيم <b>[message]</b> أو <b>[/message]</b> في رسالتك لأن ذلك قد يسبب مشكلة مع نظام bbcode');
define('NO_REPORTS', 'لا توجد تقارير متاحة');
define('ATTACKER', 'المهاجم');
define('NATAR_COUNTERFORCE', 'قوة التتار المضادة');
define('FROM_THE_VILL', 'من القرية');
define('CASUALTIES', 'الخسائر');
define('INFORMATION', 'معلومات');
define('CARRY', 'موارد');
define('DEFENDER', 'المدافع');
define('VISITED', 'زار');
define('HIS_TROOPS', ' قوات');
define('WISHES_YOU', 'يتمنى لك');
define('X_MAS', 'عيد ميلاد مجيد');
define('NEW_YEAR', 'سنة جديدة سعيدة');
define('EASTER', 'عيد فصح سعيد');
if(!defined('PEACE')) define('PEACE', 'سلام');

define('GOLD', 'ذهب');
define('GOLD_IMG', '<img src=\"/img/x.gif\" class=\"gold\" alt=\"'.GOLD.'\" title=\"'.GOLD.'\">');

//QUEST
define('Q_CONTINUE', 'الاستمرار للمهمة التالية.');
define('Q_REWARD', 'مكافأتك:');
define('Q_BUTN', 'إكمال المهمة');
define('Q0', 'مرحباً في ');
define('Q0_DESC', 'كما أرى فقد أصبحت زعيماً لهذه القرية الصغيرة. سأكون مستشارك في الأيام القليلة الأولى ولن أفارقك (اليد اليمنى).');
define('Q0_OPT1', 'إلى المهمة الأولى.');
define('Q0_OPT2', 'إلقاء نظرة بنفسي.');
define('Q0_OPT3', 'عدم تنفيذ مهام.');

define('Q1', 'المهمة 1: الحطاب');
define('Q1_DESC', 'هناك أربع غابات خضراء حول قريتك. قم ببناء حطاب في إحداها. الخشب مورد مهم لمستوطنتنا الجديدة.');
define('Q1_ORDER', 'الأمر:</p>قم ببناء حطاب.');
define('Q1_RESP', 'نعم، بهذه الطريقة ستحصل على المزيد من الخشب. لقد ساعدت قليلاً وأكملت الأمر على الفور.');
define('Q1_REWARD', 'تم إكمال الحطاب فوراً.');

define('Q2', 'المهمة 2: القمح');
define('Q2_DESC', 'الآن رعاياك جائعون من العمل طوال اليوم. قم بتطوير حقل قمح لتحسين إمدادات رعاياك. عُد إلى هنا بمجرد اكتمال البناء.');
define('Q2_ORDER', 'الأمر:</p>قم بتطوير حقل قمح واحد.');
define('Q2_RESP', 'جيد جداً. الآن لدى رعاياك ما يكفي من الطعام مرة أخرى...');
define('Q2_REWARD', 'مكافأتك:</p>يوم واحد بلس');

define('Q3', 'المهمة 3: اسم قريتك');
define('Q3_DESC', 'بصفتك مبدعاً، يمكنك منح قريتك الاسم المطلق.<br><br>انقر على \'الملف الشخصي\' في القائمة اليسرى ثم اختر \'تعديل الملف الشخصي\'...');
define('Q3_ORDER', 'الأمر:</p>غيّر اسم قريتك إلى اسم جميل.');
define('Q3_RESP', 'واو، اسم رائع لقريتهم. كان من الممكن أن يكون اسم قريتي!...');

define('Q4', 'المهمة 4: لاعبون آخرون');
define('Q4_DESC', 'في '.SERVER_NAME.' تلعب جنباً إلى جنب مع مليارات اللاعبين الآخرين. انقر على \'الإحصائيات\' في القائمة العلوية للبحث عن رتبتك وأدخلها هنا.');
define('Q4_ORDER', 'الأمر:</p>ابحث عن ترتيبك في الإحصائيات وأدخله هنا.');
define('Q4_BUTN', 'إكمال المهمة');
define('Q4_RESP', 'بالضبط! هذا هو ترتيبك.');

define('Q5', 'المهمة 5: أمري بناء');
define('Q5_DESC', 'ابنِ منجم حديد وحفرة طين. لا يمكن للمرء أبداً أن يمتلك ما يكفي من الطين والحديد.');
define('Q5_ORDER', 'الأمر:</p><ul><li>قم بتطوير منجم حديد واحد.</li><li>قم بتطوير حفرة طين واحدة.</li></ul>');
define('Q5_RESP', 'كما لاحظت، تستغرق أوامر البناء وقتاً طويلاً. سيستمر عالم '.SERVER_NAME.' في الدوران حتى لو كنت غير متصل بالإنترنت. حتى في غضون بضعة أشهر ستكون هناك أشياء جديدة لتكتشفها.<br><br>أفضل شيء تفعله هو التحقق من قريتك من حين لآخر وإعطاء رعاياك مهام جديدة ليقوموا بها.');

define('Q6', 'المهمة 6: الرسائل');
define('Q6_DESC', 'يمكنك التحدث مع لاعبين آخرين باستخدام نظام المراسلة. لقد أرسلت لك رسالة. اقرأها ثم عُد إلى هنا.<br><br>ملاحظة: لا تنس، التقارير على اليسار، والرسائل على اليمين.');
define('Q6_ORDER', 'الأمر:</p>اقرأ رسالتك الجديدة.');
define('Q6_RESP', 'هل استلمتها؟ جيد جداً.<br><br>هنا بعض الذهب. باستخدام الذهب يمكنك فعل أشياء كثيرة، مثل ترقية الـ   في القائمة اليسرى.');
define('Q6_RESP1', '-حساب أو زيادة إنتاج مواردك. للقيام بذلك انقر ');
define('Q6_RESP2', 'في القائمة اليسرى.');
define('Q6_SUBJECT', 'رسالة من مدير المهام');
define('Q6_MESSAGE', 'يُرجى إعلامك بأن هناك مكافأة جميلة تنتظرك عند مدير المهام.<br><br>تلميح: تم إنشاء الرسالة تلقائياً. لا يلزم الرد.');

define('Q7', 'المهمة 7: واحد من كل شيء!');
define('Q7_DESC', 'الآن يجب علينا زيادة إنتاج مواردك قليلاً. قم ببناء حطاب إضافي، حفرة طين، منجم حديد وحقل قمح إلى المستوى 1.');
define('Q7_ORDER', 'الأمر:</p>قم بتطوير حقل واحد من كل مورد إلى المستوى 1.');
define('Q7_RESP', 'جيد جداً، تطور رائع في إنتاج الموارد.');

define('Q8', 'المهمة 8: جيش ضخم!');
define('Q8_DESC', 'الآن لدي مهمة خاصة جداً لك. أنا جائع. أعطني 200 قمح!<br><br>في المقابل سأحاول تجهيز جيش ضخم لحماية قريتك.');
define('Q8_ORDER', 'الأمر:</p>أرسل 200 قمح إلى مدير المهام.');
define('Q8_BUTN', 'إرسال القمح');
define('Q8_NOCROP', 'لا يوجد قمح كافٍ!');

define('Q9', 'المهمة 9: كل شيء إلى المستوى 1.');
define('Q9_DESC', 'في ترافيان هناك دائماً ما يمكن القيام به! بينما تنتظر وصول الجيش الضخم، يجب علينا زيادة إنتاج الموارد قليلاً. قم بتطوير جميع حقول الموارد إلى المستوى 1.');
define('Q9_ORDER', 'الأمر:</p>قم بتطوير جميع حقول الموارد إلى المستوى 1.');
define('Q9_RESP', 'جيد جداً، إنتاج مواردك يزدهر.<br><br>قريباً يمكننا البدء بتشييد المباني في القرية.');

define('Q10', 'المهمة 10: حمامة السلام');
define('Q10_DESC', 'في الأيام الأولى بعد التسجيل أنت محمي من هجمات زملائك اللاعبين. يمكنك رؤية المدة التي تدوم فيها هذه الحماية بإضافة الرمز <b>[#0]</b> إلى ملفك الشخصي.');
define('Q10_ORDER', 'الأمر:</p>اكتب الرمز <b>[#0]</b> في ملفك الشخصي بإضافته إلى أحد حقلي الوصف.');
define('Q10_RESP', 'أحسنت! الآن يمكن للجميع رؤية المحارب العظيم الذي ظهر في العالم.');
define('Q10_REWARD', 'مكافأتك:</p>يومان بلس');

define('Q11', 'المهمة 11: جيران!');
define('Q11_DESC', 'حولك توجد العديد من القرى المختلفة. واحدة منها تسمى. ');
define('Q11_DESC1', ' انقر على \'الخريطة\' في القائمة العلوية وابحث عن تلك القرية. يمكن رؤية اسم قرى جيرانك عند تمرير مؤشر الماوس فوق أي منها.');
define('Q11_ORDER', 'الأمر:</p>ابحث عن إحداثيات ');
define('Q11_ORDER1', 'وأدخلها هنا.');
define('Q11_RESP', 'بالضبط، هذه ');
define('Q11_RESP1', ' قرية! كلما وصلت هذه الموارد للقرية. حسنا، تقريباً نفس القدر ...');
define('Q11_BUTN', 'إكمال المهمة');

define('Q12', 'المهمة 12: المخبأ');
define('Q12_DESC', 'لقد حان الوقت لبناء مخبأ. عالم '.SERVER_NAME.' خطير.<br><br>العديد من اللاعبين يعيشون على سرقة موارد اللاعبين الآخرين. قم ببناء مخبأ لإخفاء بعض مواردك من الأعداء.');
define('Q12_ORDER', 'الأمر:</p>قم ببناء مخبأ.');
define('Q12_RESP', 'أحسنت، الآن أصبح من الصعب جداً على اللاعبين السيئين نهب قريتك.<br><br>في حالة الهجوم، سيقوم القرويون بإخفاء الموارد في المخبأ بأنفسهم.');

define('Q13', 'المهمة 13: إلى الثاني.');
define('Q13_DESC', 'في '.SERVER_NAME.' هناك دائماً ما يمكن فعله! قم بتطوير حطاب واحد، حفرة طين واحدة، منجم حديد وحقل قمح إلى المستوى 2.');
define('Q13_ORDER', 'الأمر:</p>قم بتطوير حقل من كل مورد إلى المستوى 2.');
define('Q13_RESP', 'جيد جداً، قريتك تنمو وتزدهر!');

define('Q14', 'المهمة 14: التعليمات');
define('Q14_DESC', 'في التعليمات داخل اللعبة يمكنك العثور على نصوص معلومات قصيرة حول المباني المختلفة وأنواع الوحدات.<br><br>انقر على \'التعليمات\' في اليسار لمعرفة مقدار الخشب المطلوب للثكنة.');
define('Q14_ORDER', 'الأمر:</p>أدخل كمية الخشب التي تتطلبها الثكنة');
define('Q14_BUTN', 'إكمال المهمة');
define('Q14_RESP', 'بالضبط! الثكنة تتطلب 210 خشب.');

define('Q15', 'المهمة 15: المبنى الرئيسي');
define('Q15_DESC', 'يحتاج بنّاؤوك المعماريون إلى مبنى رئيسي في المستوى 3 لتشييد مبانٍ مهمة مثل السوق أو الثكنة.');
define('Q15_ORDER', 'الأمر:</p>قم بتطوير مبناك الرئيسي إلى المستوى 3.');
define('Q15_RESP', 'أحسنت. تم استكمال المبنى الرئيسي المستوى 3.<br><br>مع هذه الترقية يمكن لبنّائيك تشييد المزيد من أنواع المباني بسرعة أكبر.');

define('Q16', 'المهمة 16: متقدم!');
define('Q16_DESC', 'ابحث عن تصنيفك في إحصائيات اللاعبين مرة أخرى واستمتع بتقدمك.');
define('Q16_ORDER', 'الأمر:</p>ابحث عن مركزك في الإحصائيات وأدخله هنا.');
define('Q16_RESP', 'أحسنت! هذا هو ترتيبك الحالي.');

define('Q17', 'المهمة 17: القتال أو الاقتصاد');
define('Q17_DESC', 'الآن عليك اتخاذ قرار: إما التبادل السلمي أو أن تصبح محارباً مخيفاً.<br><br>للسوق تحتاج لمخزن حبوب، للثكنة تحتاج لنقطة تجمع.');
define('Q17_BUTN', 'الاقتصاد');
define('Q17_BUTN1', 'الجيش');

define('Q18', 'المهمة 18: الجيش');
define('Q18_DESC', 'قرار شجاع. لكي تتمكن من إرسال القوات تحتاج لنقطة تجمع.<br><br>يجب بناء نقطة التجمع في موقع محدد. موقع ');
define('Q18_DESC1', ' البناء.');
define('Q18_DESC2', ' يقع على الجانب الأيمن للمبنى الرئيسي وأسفله قليلاً. مكان البناء نفسه منحني.');
define('Q18_ORDER', 'الأمر:</p>قم ببناء نقطة تجمع.');
define('Q18_RESP', 'لقد انتهيت من بناء نقطة التجمع الخاصة بك! خطوة جيدة نحو السيطرة على العالم!');

define('Q19', 'المهمة 19: الثكنة');
define('Q19_DESC', 'الآن لديك مبنى رئيسي على المستوى 3 ونقطة تجمع. هذا يعني أنه تم استيفاء جميع المتطلبات الأساسية لبناء الثكنة.<br><br>بإمكانك استخدام الثكنة لتدريب الجنود على القتال.');
define('Q19_ORDER', 'الأمر:</p>ابن ثكنة.');
define('Q19_RESP', 'أحسنت... تم تجميع أفضل المدربين في كل البلاد لتدريب مهارات جنودك القتالية والوصول لأفضل لياقة.');

define('Q20', 'المهمة 20: تدريب.');
define('Q20_DESC', 'الآن وقد بنيت الثكنة، يمكنك البدء في تدريب القوات. قم بتدريب اثنين من ');
define('Q20_ORDER', 'يرجى تدريب 2 ');
define('Q20_RESP', 'تم وضع الأساس لجيشك القوي.<br><br>قبل إرسال جيشك للنهب عليك التحقق مع');
define('Q20_RESP1', 'محاكي المعارك');
define('Q20_RESP2', 'لترى كم جندياً تحتاج لهزيمة فأر واحد بنجاح ودون خسائر.');

define('Q21', 'المهمة 18: الاقتصاد');
define('Q21_DESC', 'التجارة والاقتصاد هما خيارك. أوقات ذهبية بانتظارك بالتأكيد!');
define('Q21_ORDER', 'الأمر:</p>قم ببناء مخزن حبوب.');
define('Q21_RESP', 'أحسنت! مع مخزن الحبوب يمكنك تخزين المزيد من القمح.');

define('Q22', 'المهمة 19: المخزن');
define('Q22_DESC', 'ليس القمح وحده هو ما يجب تخزينه. الموارد الأخرى يمكن أن تهدر كذاك إن لم تُخزّن بكفاءة. قم ببناء مخزن!');
define('Q22_ORDER', 'الأمر:</p>قم ببناء مخزن.');
define('Q22_RESP', ';ممتاز، تم بناء المخزن...&rdquo;</i><br>الآن استوفيت جميع الشروط اللازمة لبناء السوق.');

define('Q23', 'المهمة 20: السوق.');
define('Q23_DESC', ';قم ببناء سوق لتتمكن من التجارة مع زملائك اللاعبين.');
define('Q23_ORDER', 'الأمر:</p>يرجى بناء السوق.');
define('Q23_RESP', ';تم بناء السوق. يمكنك الآن إنشاء العروض الخاصة بك وقبول العروض الخارجية! عند إنشاء عروضك، يجب عليك التفكير في تقديم ما يحتاجه اللاعبون الآخرون أكثر للحصول على أرباح أكبر.');

define('Q24', 'المهمة 21: كل شيء للمستوى 2.');
define('Q24_DESC', 'الآن يجب أن نزيد إنتاج مواردك قليلاً. ابنِ حطاباً إضافياً، حفرة طين، منجم حديد وحقل قمح للمستوى 1.');
define('Q24_ORDER', 'الأمر:</p>قم بترقية جميع حقول الموارد للمستوى 2.');
define('Q24_RESP', 'تهانينا! تنمو قريتك وتزدهر...');

define('Q28', 'المهمة 22: التحالف.');
define('Q28_DESC', 'العمل الجماعي مهم في اللعبة. اللاعبون الذين يتعاونون ينضمون للتحالفات. احصل على دعوة للإنضمام إلى تحالف في منطقتك والتحق به. بديلاً عن ذلك، يمكنك بناء تحالفك الخاص بك. لفعل ذلك تحتاج إلى سفارة مستوى 3.');
define('Q28_ORDER', 'الأمر:</p>انضم لتحالف معين، أو أسس تحالفك الخاص.');
define('Q28_RESP', 'جيد! الآن أنت في اتحاد يسمى');
define('Q28_RESP1', '، وكونك عضواً في التحالف سيسمح لك بالتطور بشكل أسرع...');

define('Q29', 'المهمة 23: المبنى الرئيسي للمستوى 5');
define('Q29_DESC', 'لكي تستطيع بناء القصر أو السكن، ستحتاج لمبنى رئيسي للمستوى 5.');
define('Q29_ORDER', 'الأمر:</p>قم بتطوير مبناك الرئيسي إلى المستوى 5.');
define('Q29_RESP', 'وصل المبنى الرئيسي للمستوى 5 ويمكنك بناء القصر أو السكن...');

define('Q30', 'المهمة 24: مخزن الحبوب للمستوى 3.');
define('Q30_DESC', 'حتى لا تفقد القمح، يجب عليك ترقية مخزن الحبوب لديك.');
define('Q30_ORDER', 'الأمر:</p>قم بتطوير مخزن الحبوب إلى المستوى 3.');
define('Q30_RESP', 'وصّى مخزن الحبوب للمستوى 3 الآن...');

define('Q31', 'المهمة 25: المخزن للمستوى 7');
define('Q31_DESC', ' للتأكد من عدم فيضان مواردك، يجب عليك ترقية مخزنك.');
define('Q31_ORDER', 'الأمر:</p>قم بتطوير المخزن إلى المستوى 7.');
define('Q31_RESP', 'تم ترقية المخزن للمستوى 7 الآن...');

define('Q32', 'المهمة 26: الكل إلى خمسة!');
define('Q32_DESC', 'ستحتاج دائماً لمزيد من الموارد. حقول الموارد مكلفة كفاية لكنها تُوفي غرضها على المدى البعيد دائماً.');
define('Q32_ORDER', 'الأمر:</p>قم بتطوير جميع حقول مواردك للمستوى 5.');
define('Q32_RESP', 'جميع الموارد الآن بالمستوى 5، ممتاز، تنمو قريتك وتزدهر!');

define('Q33', 'المهمة 27: القصر أم السكن؟');
define('Q33_DESC', 'لتأسيس قرية جديدة، ستحتاج إلى مستوطنين. أولئك يمكنك تدريبهم إما في القصر أو السكن.');
define('Q33_ORDER', 'الأمر:</p>قم ببناء قصر أو سكن لتصل للمستوى 10.');
define('Q33_RESP', 'وصلت للمستوى 10، الآن يمكنك تدريب المستوطنين وتأسيس قريتك الثانية. لا تنسى النقاط الحضارية...');

define('Q34', 'المهمة 28: 3 مستوطنين.');
define('Q34_DESC', 'لتأسيس قرية جديدة، ستحتاج إلى 3 مستوطنين. يمكنك تدريبهم إما في القصر أو السكن.');
define('Q34_ORDER', 'الأمر:</p>قم بتدريب 3 من المستوطنين.');
define('Q34_RESP', 'تم تدريب 3 مستوطنين. لتأسيس قرية جديدة تحتاج على الأقل لـ');
define('Q34_RESP1', 'نقاط حضارية...');

define('Q35', 'المهمة 29: قرية جديدة.');
define('Q35_DESC', 'بها الكثير من الأماكن الفارغة في الخريطة. جِد مكاناً يناسبك وأسس قرية جديدة');
define('Q35_ORDER', 'الأمر:</p>قم بتأسيس قرية جديدة.');
define('Q35_RESP', 'أنا فخور بك! الآن لديك قريتان وتتمتع بكافة الصلاحيات لبناء إمبراطورية عظيمة. أتمنى لك الحظ مع ذلك.');

define('Q36', ' المهمة 30: بناء أو تشييد ');
define('Q36_DESC', 'الآن وبعد أن قمت بتدريب جنود، يجب عليك بناء ');
define('Q36_DESC1', ' أيضا. فإنه يزيد من الدفاع الأساسي ويجعل جنودك يحصلون على مكافأة دفاعية.');
define('Q36_ORDER', 'الأمر:</p>قم ببناء ');
define('Q36_RESP', 'هذا ما كنت أتحدث عنه. الـ ');
define('Q36_RESP1', ' مفيد جداً. يزيد من دفاع الجنود داخل قريتك.');

define('Q37', 'المهام');
define('Q37_DESC', 'جميع المهام أنجزت!');

// CUSTOM CONSTANTS FOR BUILDING QUEUE
define('LEVEL_TEXT', 'مستوى');
define('IN_TEXT', 'في');
define('HRS_TEXT', 'ساعات');
define('DONE_AT_TEXT', 'ينتهي في');
define('FINISH_ALL_CONSTRUCTION_GOLD', 'إنهاء جميع أوامر البناء والبحث في هذه القرية فوراً مقابل 2 ذهب؟');
define('UPGRADE_TO_LEVEL_MAX', 'ترقية إلى المستوى');
define('GOLD_TEXT', 'ذهب');
define('NOT_ENOUGH_GOLD_TEXT', 'الذهب لا يكفي');
define('CONFIRM_UPGRADE_MAX_GOLD', 'هل ترغب في ترقية هذا المبنى إلى أقصى مستوى (%s) مقابل %s ذهب؟');
define('CELEBRATION_NEEDS', 'الاحتفال لا يزال يحتاج إلى:');